app/Controllers/AturSiswa.php

    public function index()
    {
        helper(['form']);
        $perPage = 10;
        $page = (int) ($this->request->getGet('page') ?? 1);
        $total = $this->siswaModel->countAll();
---
SELECT COUNT(*) AS "numrows" FROM "siswa"

    public function edit($id)
    {
        $data = [
            'menu' => 'Perencanaan',
            'title' => 'Atur Siswa',
            'siswa' => $this->siswaModel->find($id),
            //'siswa' => $this->siswaModel->findSiswa($id),
            'on' => true,
        ];
---
SELECT *
FROM "siswa"
WHERE "siswa"."id" = '2'