app/Controllers/AturInfaq.php

    public function index()
    {
        helper(['form']);
        $infaqModel = new InfaqModel();
        $perPage = 10;
        $page = (int) ($this->request->getGet('page') ?? 1);
        $total = $infaqModel->countAll();
---
SELECT COUNT(*) AS "numrows" FROM "infaq"

    public function save()
    {
        helper(['form']);
        $rules =
        [
            'name' => 'required|min_length[6]|max_length[40]',
            'kelas' => 'required|min_length[1]|max_length[3]|',
            'harga' => 'required|min_length[4]|max_length[7]|',
        ];

        if($this->validate($rules))
        {
            $model = new InfaqModel();
            $data =
            [
                'name' => $this->request->getVar('name'),
                'kelas' => $this->request->getVar('kelas'),
                'harga' => $this->request->getVar('harga'),
            ];
            $model->save($data);
---
INSERT INTO "infaq" ("name", "kelas", "harga") VALUES ('Ujian Akhir Nasional', '9', '500000')

    public function edit($id)
    {
        //helper(['form']);
        $model = new InfaqModel();

        $data = [
            'menu' => 'Perencanaan',
            'title' => 'Atur Jenis Infaq',
            'infaq' => $model->find($id),
---
SELECT *
FROM "infaq"
WHERE "infaq"."id" = '1'