app/Controllers/LoginAdministrator.php

    public function auth()
    {
        $session = session();
        $model = new AdministratorModel();
        $adminname = $this->request->getVar('adminname');
        $password = $this->request->getVar('password');
        $data = $model->where('adminname', $adminname)->first();
---
SELECT *
FROM "administrator"
WHERE "adminname" = 'hakimarvinnoer'
 LIMIT 1