app/Controllers/Pembayaran.php

INSERT INTO "pembayaran" ("idsiswa", "idinfaq", "nominal", "status") VALUES ('707', '13', '40000', 'Sukses')
---
    public function save()
    {
        helper(['form']);
        $rules =
        [
            'idsiswa' => 'required',
            'idinfaq' => 'required',
            'nominal' => 'required',
        ];

        if($this->validate($rules))
        {
            $model = new PembayaranModel();
            $data =
            [
                'idsiswa' => $this->request->getVar('idsiswa'),
                'idinfaq' => $this->request->getVar('idinfaq'),
                'nominal' => $this->request->getVar('nominal'),
                'status' => 'Sukses',
            ];
            $model->save($data);