app/Controllers/RegisterAdministrator.php

SELECT COUNT(*) AS "numrows" FROM "administrator"
---
    public function index()
    {
        helper(['form']);
        $Model = new AdministratorModel();
        $perPage = 10;
        $page = (int) ($this->request->getGet('page') ?? 1);
        $total = $Model->countAll();

INSERT INTO "administrator" ("name", "adminname", "role", "password") VALUES ('Ibnu Sadun Isngadi', 'ibnusadun', 'KepalaSekolah', '$2y$10$Q89F4R.BMlIaipkgF/lcYON2M5xHubLVjLYCHZp5N0lQVlJTy3.rm')
---
    public function save()
    {
        helper(['form']);
        $rules =
        [
            'name' => 'required|min_length[6]|max_length[40]',
            'adminname' => 'required|min_length[6]|max_length[40]',
            'role' => 'required|min_length[6]|max_length[40]',
            'password' => 'required|min_length[6]|',
        ];

        if($this->validate($rules))
        {
            $model = new AdministratorModel();
            $data =
            [
                'name' => $this->request->getVar('name'),
                'adminname' => $this->request->getVar('adminname'),
                'role' => $this->request->getVar('role'),
                'password' => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT)
            ];
            $model->save($data);