app/Models/AdministratorModel.php

    public function getPaginated($limit, $offset)
    {
        return $this->orderBy('idadmin', 'ASC')
                    ->limit($limit, $offset)
                    ->find();
---
SELECT *
FROM "administrator"
ORDER BY "idadmin" ASC
 LIMIT 10