app/Models/InfaqModel.php

SELECT COUNT(*) AS "numrows" FROM "infaq"
---
    public function getTotalInfaq()
    {
        return $this->countAll();

SELECT *
FROM "infaq"
ORDER BY "id" ASC
 LIMIT 10 OFFSET 20
---
    public function getPaginated($limit, $offset)
    {
        return $this->orderBy('id', 'ASC')
                    ->limit($limit, $offset)
                    ->find();

SELECT *
FROM "infaq"
WHERE LOWER(name) LIKE '%9%' ESCAPE '!'
---
    public function search($keyword)
    {
        return $this->table('infaq')
                    ->like('LOWER(name)', strtolower($keyword))
                    ->findAll();

SELECT *
FROM "infaq"
WHERE "kelas" LIKE '%7%' ESCAPE '!'
---
    public function searchByKelas($keyword)
    {
        return $this->table('infaq')
                    ->like('kelas',$keyword)
                    ->findAll();