app/Models/PembayaranModel.php

SELECT "siswa"."nis", "siswa"."name" as "nama_siswa", "siswa"."kelas", "infaq"."name" as "nama_infaq", "pembayaran".*
FROM "pembayaran"
JOIN "siswa" ON "pembayaran"."idsiswa" = "siswa"."nis"
JOIN "infaq" ON "pembayaran"."idinfaq" = "infaq"."id"
---
    public function getPembayaran()
    {
        return $this
        ->join('siswa','pembayaran.idsiswa = siswa.nis')
        ->join('infaq','pembayaran.idinfaq = infaq.id')
        ->select('
            siswa.nis,
            siswa.name as nama_siswa,
            siswa.kelas,
            infaq.name as nama_infaq,
            pembayaran.*
        ')
        ->findAll();