app/Models/SiswaModel.php

SELECT COUNT(*) AS "numrows" FROM "siswa"
---
    public function getTotalSiswa()
    {
        return $this->countAll(); // Hitung total semua siswa

SELECT *
FROM "siswa"
ORDER BY "id" ASC
 LIMIT 10
---
    public function getPaginatedSiswa($limit, $offset)
    {
        return $this->orderBy('id', 'ASC')
                    ->limit($limit, $offset)
                    ->find();

SELECT *
FROM "siswa"
WHERE LOWER(name) LIKE '%aida%' ESCAPE '!'
---
    public function search($keyword)
    {
        return $this->table('siswa')
                    ->like('LOWER(name)', strtolower($keyword))
                    ->findAll();